app/Models/Client_Management.php

SELECT `id`, `first_name`, `user_email`, `user_status`
FROM `user_master`
WHERE `user_type` = 4
SELECT `user_products_ids`
FROM `user_profile`
WHERE `user_id` = '2'
SELECT `product_name`
FROM `products`
WHERE `product_id` = '1'
---
    public function getClients($data)
    {
        $productId_query = "";
        $AndQueryBuild = " OR product_id =";
        $userType = $data['user_type'];

        $matchingArray = [];

        $product_ids = explode('#', $data['product_id']);

        $query = $this->db->table('user_master')
            ->select('id, first_name, user_email, user_status')
            ->where('user_type', $userType)
            ->get();

        $users = $query->getResult();

        foreach ($users as $user) {
            $allproducts_query = $this->db->table('user_profile')
                ->select('user_products_ids')
                ->where('user_id', $user->id)
                ->get();

            $all_products = $allproducts_query->getResult();

            $product_ids = explode('#', $all_products[0]->user_products_ids);
                foreach ($product_ids as $product_id) {
                    $products_query = $this->db->table('products')
                        ->select('product_name')
                        ->where('product_id', $product_id)
                        ->get();

SELECT `id`, `first_name`, `last_name`, `user_email`, `user_status`, `user_contact`
FROM `user_master`
WHERE `user_type` = 4
SELECT `user_products_ids`
FROM `user_profile`
WHERE `user_id` = '2'
SELECT `product_id`, `product_name`
FROM `products`
WHERE `product_id` = '1'
---
    public function getClientById($id)
    {


        $query = $this->db->table('user_master')
            ->select('id, first_name, last_name, user_email, user_status, user_contact')
            ->where('user_type', 4)
            ->get();

        $users = $query->getResult();

        foreach ($users as $user) {
            $allproducts_query = $this->db->table('user_profile')
                ->select('user_products_ids')
                ->where('user_id', $user->id)
                ->get();

            $all_products = $allproducts_query->getResult();

            $product_ids = explode('#', $all_products[0]->user_products_ids);
            foreach ($product_ids as $key => $product_id) {
                $products_query = $this->db->table('products')
                    ->select('product_id, product_name')
                    ->where('product_id', $product_id)
                    ->get();