app/Models/Posts_Management.php

    public function getPosts($data)
    {
        $productId_query = "";
        $AndQueryBuild = " OR product_id =";

        $product_ids = explode('#', $data['product_id']);

        foreach ($product_ids as $key => $product_id) {

            if($key == 0){
                $productId_query .= $product_id;
            }else{
                $productId_query .=  $AndQueryBuild.$product_id;
            }

        }
        $query = $this->db->table('cw_posts')
            ->select('_id, post_title, post_content, post_slug, post_status')
            ->where('product_id', $productId_query)
            ->get();
---
SELECT `_id`, `post_title`, `post_content`, `post_slug`, `post_status`
FROM `cw_posts`
WHERE `product_id` = '1 OR product_id =2'

    public function getPostsForCw($userId)
    {
        $query = $this->db->table('cw_posts')
            ->select('_id, post_title, post_content, post_slug, post_status')
            ->where('created_by', $userId)
            ->get();

        $posts = $query->getResult();
---
SELECT `_id`, `post_title`, `post_content`, `post_slug`, `post_status`
FROM `cw_posts`
WHERE `created_by` = '3'
SELECT `_id`, `product_id`, `post_title`, `post_content`, `post_slug`, `post_status`, `post_image`
FROM `cw_posts`
WHERE `post_slug` = 'post'

    public function getPostBySlug($id)
    {


        $query = $this->db->table('cw_posts')
            ->select('_id, product_id, post_title, post_content, post_slug, post_status, post_image')
            ->where('post_slug', $id)
            ->get();

        $post = $query->getResult();

        $products_query = $this->db->table('products')
            ->select('product_name')
            ->where('product_id', $post[0]->product_id)
            ->get();
---
SELECT `_id`, `product_id`, `post_title`, `post_content`, `post_slug`, `post_status`, `post_image`
FROM `cw_posts`
WHERE `post_slug` = 'post'
SELECT `product_name`
FROM `products`
WHERE `product_id` = '1'