app/Models/Rm_SupportModel.php

SELECT `_id`, `user_id`, `comments`, `admin_reply`, `created_on`, `replied_on`
FROM `contact_us`
WHERE `user_id` = '1'
---
    public function getList($user_id)
    {
    $query = $this->db->table('contact_us')
            ->select('id, user_id, comments, admin_reply, created_on, replied_on')
            ->where('user_id', $user_id)
            ->get();